; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l13-t1-p3---int100n150-m25---int100c110---s200---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level51 level19 level70)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level52 level19 level71)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level53 level19 level72)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level54 level19 level73)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level55 level19 level74)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level56 level19 level75)
(sum level56 level22 level78)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level57 level19 level76)
(sum level57 level22 level79)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level16 level74)
(sum level58 level19 level77)
(sum level58 level22 level80)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level59 level16 level75)
(sum level59 level19 level78)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level60 level16 level76)
(sum level60 level19 level79)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level61 level15 level76)
(sum level61 level16 level77)
(sum level61 level19 level80)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level13 level75)
(sum level62 level14 level76)
(sum level62 level15 level77)
(sum level62 level16 level78)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level13 level76)
(sum level63 level14 level77)
(sum level63 level15 level78)
(sum level63 level16 level79)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level13 level77)
(sum level64 level14 level78)
(sum level64 level15 level79)
(sum level64 level16 level80)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level13 level78)
(sum level65 level14 level79)
(sum level65 level15 level80)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level66 level13 level79)
(sum level66 level14 level80)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level67 level13 level80)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level7 level78)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level7 level79)
(sum level72 level8 level80)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level7 level80)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level79 level1 level80)

(connected l0 l5)
(fuelcost level22 l0 l5)
(connected l0 l6)
(fuelcost level16 l0 l6)
(connected l0 l11)
(fuelcost level9 l0 l11)
(connected l0 l12)
(fuelcost level25 l0 l12)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l1 l7)
(fuelcost level16 l1 l7)
(connected l1 l9)
(fuelcost level13 l1 l9)
(connected l1 l11)
(fuelcost level19 l1 l11)
(connected l2 l1)
(fuelcost level1 l2 l1)
(connected l2 l3)
(fuelcost level19 l2 l3)
(connected l2 l4)
(fuelcost level8 l2 l4)
(connected l2 l10)
(fuelcost level15 l2 l10)
(connected l3 l2)
(fuelcost level19 l3 l2)
(connected l3 l6)
(fuelcost level14 l3 l6)
(connected l4 l2)
(fuelcost level8 l4 l2)
(connected l4 l5)
(fuelcost level2 l4 l5)
(connected l4 l10)
(fuelcost level22 l4 l10)
(connected l5 l0)
(fuelcost level22 l5 l0)
(connected l5 l4)
(fuelcost level2 l5 l4)
(connected l5 l6)
(fuelcost level3 l5 l6)
(connected l6 l0)
(fuelcost level16 l6 l0)
(connected l6 l3)
(fuelcost level14 l6 l3)
(connected l6 l5)
(fuelcost level3 l6 l5)
(connected l6 l8)
(fuelcost level22 l6 l8)
(connected l6 l9)
(fuelcost level19 l6 l9)
(connected l7 l1)
(fuelcost level16 l7 l1)
(connected l8 l6)
(fuelcost level22 l8 l6)
(connected l9 l1)
(fuelcost level13 l9 l1)
(connected l9 l6)
(fuelcost level19 l9 l6)
(connected l9 l12)
(fuelcost level8 l9 l12)
(connected l10 l2)
(fuelcost level15 l10 l2)
(connected l10 l4)
(fuelcost level22 l10 l4)
(connected l10 l12)
(fuelcost level7 l10 l12)
(connected l11 l0)
(fuelcost level9 l11 l0)
(connected l11 l1)
(fuelcost level19 l11 l1)
(connected l12 l0)
(fuelcost level25 l12 l0)
(connected l12 l9)
(fuelcost level8 l12 l9)
(connected l12 l10)
(fuelcost level7 l12 l10)

(at t0 l7)
(fuel t0 level80)
(= (total-cost) 0)

(at p0 l1)
(at p1 l7)
(at p2 l12)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l11)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l7)
   deleted: (at p1 l7)
   added: (in p1 t0)
   goals met: 0 of 3
2. (drive t0 l7 l1 level64 level16 level80)
   deleted: (at t0 l7) (fuel t0 level80)
   added: (at t0 l1) (fuel t0 level64)
   goals met: 0 of 3
3. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 1 of 3
4. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 3
5. (drive t0 l1 l2 level63 level1 level64)
   deleted: (at t0 l1) (fuel t0 level64)
   added: (at t0 l2) (fuel t0 level63)
   goals met: 1 of 3
6. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 2 of 3
7. (drive t0 l2 l10 level48 level15 level63)
   deleted: (at t0 l2) (fuel t0 level63)
   added: (at t0 l10) (fuel t0 level48)
   goals met: 2 of 3
8. (drive t0 l10 l12 level41 level7 level48)
   deleted: (at t0 l10) (fuel t0 level48)
   added: (at t0 l12) (fuel t0 level41)
   goals met: 2 of 3
9. (load p2 t0 l12)
   deleted: (at p2 l12)
   added: (in p2 t0)
   goals met: 2 of 3
10. (drive t0 l12 l0 level16 level25 level41)
   deleted: (at t0 l12) (fuel t0 level41)
   added: (at t0 l0) (fuel t0 level16)
   goals met: 2 of 3
11. (drive t0 l0 l11 level7 level9 level16)
   deleted: (at t0 l0) (fuel t0 level16)
   added: (at t0 l11) (fuel t0 level7)
   goals met: 2 of 3
12. (unload p2 t0 l11)
   deleted: (in p2 t0)
   added: (at p2 l11)
   goals met: 3 of 3
